{"config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 3, 112, 112, 3], "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "conv_1", "class_name": "Conv3D", "config": {"filters": 64, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "conv_1", "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3, 3], "kernel_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "maxpool_1a", "class_name": "MaxPooling3D", "config": {"pool_size": [2, 2, 2], "name": "maxpool_1a", "padding": "same", "trainable": true, "strides": [2, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv_1", 0, 0, {}]]]}, {"name": "batchnorm_1", "class_name": "BatchNormalization", "config": {"center": true, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "name": "batchnorm_1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "trainable": true, "epsilon": 0.001}, "inbound_nodes": [[["maxpool_1a", 0, 0, {}]]]}, {"name": "conv_2", "class_name": "Conv3D", "config": {"filters": 128, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "conv_2", "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3, 3], "kernel_constraint": null}, "inbound_nodes": [[["batchnorm_1", 0, 0, {}]]]}, {"name": "maxpool_2", "class_name": "MaxPooling3D", "config": {"pool_size": [2, 2, 2], "name": "maxpool_2", "padding": "same", "trainable": true, "strides": [2, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv_2", 0, 0, {}]]]}, {"name": "conv_3", "class_name": "Conv3D", "config": {"filters": 256, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "conv_3", "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3, 3], "kernel_constraint": null}, "inbound_nodes": [[["maxpool_2", 0, 0, {}]]]}, {"name": "conv_4", "class_name": "Conv3D", "config": {"filters": 256, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "conv_4", "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3, 3], "kernel_constraint": null}, "inbound_nodes": [[["conv_3", 0, 0, {}]]]}, {"name": "maxpool_4", "class_name": "MaxPooling3D", "config": {"pool_size": [2, 2, 2], "name": "maxpool_4", "padding": "same", "trainable": true, "strides": [2, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv_4", 0, 0, {}]]]}, {"name": "conv_5", "class_name": "Conv3D", "config": {"filters": 512, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "conv_5", "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3, 3], "kernel_constraint": null}, "inbound_nodes": [[["maxpool_4", 0, 0, {}]]]}, {"name": "conv_6", "class_name": "Conv3D", "config": {"filters": 512, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "strides": [1, 1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "name": "conv_6", "padding": "same", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1, 1], "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3, 3], "kernel_constraint": null}, "inbound_nodes": [[["conv_5", 0, 0, {}]]]}, {"name": "maxpool_6", "class_name": "MaxPooling3D", "config": {"pool_size": [2, 2, 2], "name": "maxpool_6", "padding": "same", "trainable": true, "strides": [2, 2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv_6", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"trainable": true, "name": "flatten", "data_format": "channels_last"}, "inbound_nodes": [[["maxpool_6", 0, 0, {}]]]}, {"name": "fc_1", "class_name": "Dense", "config": {"activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 4096, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "name": "fc_1", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.3}, "inbound_nodes": [[["fc_1", 0, 0, {}]]]}, {"name": "predictions", "class_name": "Dense", "config": {"activation": "softmax", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 8, "use_bias": true, "activity_regularizer": null, "bias_constraint": null, "name": "predictions", "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "name": "MOC3D", "output_layers": [["predictions", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.0"}